Repository: ESNyarobi123/tendapoa-back
Catalog: lib/l10n/app_*.arb
Languages: sw

# register_terms_notice
source: By registering you agree to our Terms and Privacy Policy.
sw: Kwa kusajili, unakubali Masharti na Sera ya Faragha yetu.

# register_btn_muhitaji
source: CREATE ACCOUNT
sw: TENGENEZA AKAUNTI

# register_btn_mfanyakazi
source: JOIN AS WORKER
sw: JIUNGE KAMA Mfanyakazi

# register_location_title
source: Your Location
sw: Eneo Lako

# register_required_badge
source: REQUIRED
sw: LAZIMA

# register_location_found
source: Location found!
sw: Eneo limepatikana!

# register_location_tap
source: Tap to get your location
sw: Bonyeza kupata eneo lako

# register_location_help
source: Your location helps clients find you easily and get jobs near you.
sw: Eneo lako linasaidia wateja kukupata kwa urahisi na kupata kazi zilizo karibu nawe.

# register_location_searching
source: Finding location...
sw: Inatafuta eneo...

# register_location_refresh
source: Refresh Location
sw: Sasisha Eneo

# register_location_get_btn
source: GET MY LOCATION
sw: PATA ENEO LANGU

# register_location_success
source: Your location was found!
sw: Eneo lako limepatikana!

# register_location_disabled
source: Location service is off. Please enable GPS.
sw: Huduma ya eneo haijawashwa. Tafadhali washa GPS.

# register_location_denied
source: Location permission denied
sw: Ruhusa ya eneo imekataliwa

# register_location_denied_forever
source: Location permission permanently denied. Go to Settings to change.
sw: Ruhusa ya eneo imekataliwa kabisa. Nenda Settings kubadilisha.

# register_location_failed
source: Failed to get location
sw: Imeshindikana kupata eneo

# splash_tagline
source: Job Done!
sw: Kazi Imeisha!

# confirm_delete_title
source: Delete Job?
sw: Futa Kazi?

# min_amount_error
source: Minimum amount is TZS 5,000
sw: Kiasi cha chini ni TZS 5,000

# fill_all_fields
source: Please fill in all fields
sw: Tafadhali jaza taarifa zote

# withdrawal_submitted
source: Your request has been submitted! Awaiting verification.
sw: Ombi lako limewasilishwa! Subiri uthibitisho.

# error_prefix
source: Error
sw: Hitilafu

# post_job_new
source: Post New Job
sw: Post Kazi Mpya

# gps_enable_first
source: Please enable GPS first
sw: Tafadhali washa GPS yako kwanza

source: Location detected
sw: Eneo limetambuliwa

# job_location_placeholder
source: Job location
sw: Eneo la Kazi

# step_details
source: Details
sw: Maelezo

# step_location_post
source: Location & Post
sw: Eneo & Post

# post_need_help
source: What help do you need?
sw: Unahitaji msaidizi gani?

# post_fill_details
source: Fill in these details so nearby workers can apply.
sw: Jaza taarifa hizi ili maMfanyakazi wa karibu waanze kuomba.

# post_title_hint
source: e.g. Need a plumber to fix sink
sw: Mfano: Napata Mfanyakazi bomba wa kurekebisha sinki

# post_budget_hint
source: e.g. 20,000
sw: Mfano: 20,000

# post_description_hint
source: Describe the job in detail...
sw: Elezea kazi kwa undani zaidi hapa...

# post_description_error
source: Please describe the job
sw: Elezea kazi yako

# post_location_help
source: We use your GPS so nearby workers can see your job.
sw: Tunatumia GPS yako kutambua eneo ili maMfanyakazi wa karibu zaidi waone kazi yako.

# post_location_searching
source: Finding location...
sw: Inatafuta eneo...

# post_allow_gps
source: Please allow GPS first
sw: Tafadhali ruhusu GPS kwanza

# post_retry_location
source: RETRY LOCATION
sw: RUDIA KUTAFUTA

# post_searching_workers
source: Searching for workers near you...
sw: Inatafuta wafanyakazi karibu nawe...

# post_no_workers_nearby
source: No Workers Nearby
sw: Hakuna Wafanyakazi Karibu

# post_continue_anyway
source: You can continue but it may take longer to find a worker.
sw: Unaweza kuendelea lakini muda wa kupata mfanyakazi unaweza kuwa mrefu.

# post_workers_found
source: Workers Found!
sw: Wafanyakazi Wamepatikana!

# post_job_visible_soon
source: Your job will be visible soon!
sw: Kazi yako itaonekana haraka!

# post_within_km
source: within
sw: ndani

# post_continue_btn
source: Continue
sw: Endelea

source: Choose Photo
sw: Chagua Picha

source: Camera
sw: Kamera

source: Gallery
sw: Galeri

source: Profile updated!
sw: Wasifu umesasishwa!

source: Today
sw: Leo

source: Yesterday
sw: Jana

source: Mark all read
sw: Soma Zote

source: No notifications
sw: Hakuna Taarifa

# notifications_empty_sub
source: Your notifications will appear here
sw: Taarifa zako zitaonekana hapa

# edit_job_title
source: Edit Job
sw: Hariri Kazi

# select_job_location
source: Please select job location on the map
sw: Tafadhali chagua eneo la kazi kwenye ramani

# price_cannot_decrease
source: You cannot reduce the price. Current price is TZS
sw: Huwezi kupunguza bei. Bei ya sasa ni TZS

# extra_payment_required
source: Additional payment required
sw: Malipo ya ziada yanahitajika

source: Job updated!
sw: Kazi imebadilishwa!

# refund_note
source: If the job was paid, funds will be refunded to your wallet.
sw: Kama kazi ililipiwa, pesa itarudishwa kwenye wallet yako.

source: Job deleted!
sw: Kazi imefutwa!

source: Cannot Edit
sw: Huwezi Kuhariri

# cannot_edit_reason
source: This job cannot be edited because it has started or been completed.
sw: Kazi hii haiwezi kuhaririwa kwa sababu imeanza au imekamilika.

# edit_section_title
source: Title
sw: Kichwa cha Kazi

# edit_section_category
source: Category
sw: Kategoria

# edit_section_price
source: Price (TZS)
sw: Bei (TZS)

# edit_section_description
source: Description
sw: Maelezo

# edit_price_hint
source: e.g. 25000
sw: Mfano: 25000

# edit_price_required
source: Enter price
sw: Weka bei

# edit_price_min
source: Price must be at least TZS 500
sw: Bei lazima iwe TZS 500+

# edit_current_price_prefix
source: Current price: TZS
sw: Bei ya sasa: TZS

# edit_current_price_suffix
source: . You can only increase, not decrease.
sw: . Unaweza kuongeza tu, si kupunguza.

# edit_my_location
source: My Location
sw: Eneo Langu

# edit_address
source: Address
sw: Anwani

# edit_title_hint
source: e.g. Plumber Needed
sw: Mfano: Mfanyakazi Bomba Anahitajika

# edit_title_required
source: Enter title
sw: Weka kichwa

# edit_description_hint
source: Describe the job in detail...
sw: Eleza kazi kwa undani...

# edit_select_category
source: Select category
sw: Chagua kategoria

# edit_section_image
source: Job Image
sw: Picha ya Kazi

# edit_tap_add_photo
source: Tap to add photo
sw: Bonyeza kuongeza picha

# edit_change_photo
source: Change
sw: Badilisha

# edit_address_placeholder
source: Tap map to select location
sw: Bonyeza ramani kuchagua eneo

# payment_check_phone
source: Please check your phone and enter M-Pesa PIN...
sw: Tafadhali kagua simu yako na uingize PIN ya M-Pesa...

# payment_timeout
source: Time's up. Payment was not completed.
sw: Muda umeisha. Malipo hayajakamilika.

# payment_success_msg
source: Payment Successful! Your job is now live.
sw: Malipo Yamefanikiwa! Kazi yako sasa ipo hewani.

# payment_retrying
source: Starting payment again...
sw: Inaanzisha malipo tena...

# payment_retry_failed
source: Failed to start payment. Try again.
sw: Imeshindikana kuanzisha malipo. Jaribu tena.

# payment_retry_btn
source: Retry
sw: JARIBU TENA

source: Cancel and Go Back
sw: Futa na Rudi Nyuma

# payment_dont_close
source: Do not close this page until you get confirmation.
sw: Usifunge ukurasa huu mpaka utakapopata uthibitisho.

# payment_check_phone_label
source: Check phone
sw: Angalia simu

# payment_enter_pin
source: Enter PIN
sw: Ingiza PIN

# payment_confirm
source: Confirm
sw: Thibitisha

# payment_status_completed
source: Payment completed
sw: MALIPO YAMEKAMILIKA

# payment_status_failed
source: Payment failed
sw: MALIPO YAMESHINDIKANA

# payment_status_waiting
source: Waiting for payment
sw: INASUBIRI MALIPO

# payment_exit_title
source: Want to leave?
sw: Unataka Kutoka?

# payment_exit_message
source: If payment is still in progress, your job will be posted once payment completes.
sw: Ikiwa malipo bado yanaendelea, kazi yako itachapishwa baada ya malipo kukamilika.

# continue_waiting
source: Keep Waiting
sw: Endelea Kusubiri

# leave_btn
source: Leave
sw: Toka

# dash_balance_label
source: Your Balance
sw: SALIO LAKO

# dash_withdraw_btn
source: Withdraw
sw: TOA PESA (Withdraw)

# dash_total_earnings
source: Total Earnings
sw: Mapato Jumla

# dash_withdrawn
source: Withdrawn
sw: Imechukuliwa

# dash_jobs_completed
source: Jobs Completed
sw: Kazi Zilizomalizika

# dash_monthly_jobs
source: Jobs This Month
sw: Kazi za Mwezi

# dash_earnings_history
source: Earnings History
sw: Historia ya Mapato

# dash_withdrawal_history
source: Withdrawal History
sw: Historia ya Uchukuliaji

# view_all_btn
source: View All
sw: Ona Zote

# wallet_my_wallet
source: My Wallet
sw: Mkoba Wangu

# wallet_balance_now
source: Current Balance
sw: SALIO LAKO LA SASA

# wallet_add_balance
source: Add Balance
sw: Ongeza Salio

# wallet_withdraw
source: Withdraw
sw: Toa Fedha

# wallet_payment_history
source: Payment History
sw: Historia ya Malipo

# wallet_view_all
source: View All
sw: Ona Zote

# wallet_no_history
source: No wallet activity yet
sw: Bado hujaanza kutumia mkoba

# wallet_credit
source: Credit
sw: Pesa Ingia

# wallet_debit
source: Debit
sw: Pesa Toka

# withdrawal_insufficient
source: Insufficient balance. You need TZS
sw: Salio lako halitoshi. Unahitaji TZS

# withdrawal_failed_submit
source: Failed to submit request
sw: Imeshindikana kutuma ombi

# withdrawal_title
source: Withdraw
sw: Toa Pesa

# withdrawal_subtitle
source: Fill the form to withdraw to your phone
sw: Jaza fomu hii kutoa pesa kwenye simu yako

# withdrawal_amount_section
source: Amount to Withdraw
sw: Kiasi cha Kutoa

# withdrawal_amount_hint
source: Enter amount (e.g. 10000)
sw: Weka kiasi (mf. 10000)

# withdrawal_amount_required
source: Please enter amount
sw: Tafadhali weka kiasi

# withdrawal_min_label
source: Minimum:
sw: Kiasi cha chini:

# withdrawal_fee_label
source: Service fee:
sw: Makato ya huduma:

# withdrawal_you_receive
source: You will receive:
sw: Utapokea:

# withdrawal_network_section
source: Select Network
sw: Chagua Mtandao

# withdrawal_phone_section
source: Phone Number
sw: Nambari ya Simu

# withdrawal_phone_required
source: Please enter phone number
sw: Tafadhali weka nambari ya simu

# withdrawal_phone_invalid
source: Invalid phone number
sw: Nambari ya simu si sahihi

# withdrawal_name_section
source: Registered Name
sw: Jina Lililosajiliwa

# withdrawal_name_hint
source: Name as on M-Pesa/Tigo Pesa
sw: Jina linaloonekana kwenye M-Pesa/Tigo Pesa

# withdrawal_name_required
source: Please enter registered name
sw: Tafadhali weka jina lililosajiliwa

# withdrawal_name_short
source: Name too short
sw: Jina ni fupi sana

# withdrawal_submit_btn
source: SUBMIT WITHDRAWAL REQUEST
sw: TUMA OMBI LA KUTOA PESA

# withdrawal_success_title
source: Request Sent!
sw: Ombi Limetumwa!

# withdrawal_success_body
source: Your withdrawal request for TZS
sw: Ombi lako la kutoa TZS

# withdrawal_success_footer
source: Await Admin verification. Funds within 24 hours.
sw: Subiri uthibitisho wa Admin. Pesa itatumwa ndani ya masaa 24.

# withdrawal_ok_btn
source: OK
sw: SAWA

# withdrawal_history_title
source: Withdrawal History
sw: Historia ya Kutoa Pesa

# withdrawal_no_history
source: No withdrawal history
sw: Hakuna historia ya kutoa pesa

# withdrawal_important_note
source: Important!
sw: Muhimu!

# withdrawal_note_body
source: Ensure phone number and name are correct. Funds will be sent within 24 hours after Admin verification.
sw: Hakikisha nambari ya simu na jina ni sahihi. Pesa itatumwa ndani ya masaa 24 baada ya uthibitisho wa Admin.

# withdrawal_status_paid
source: Paid
sw: Imelipwa

# withdrawal_status_rejected
source: Rejected
sw: Imekataliwa

# withdrawal_status_pending
source: Pending
sw: Inasubiri
