Repository: ESNyarobi123/tendapoa-back
Catalog: lib/l10n/app_*.arb
Languages: sw

# applications_tab
source: Applications
sw: Maombi

source: Settings
sw: Mipangilio

source: Appearance
sw: Muonekano

source: Theme
sw: Mandhari

# lightTheme
source: Light
sw: Mwangaza

# darkTheme
source: Dark
sw: Giza

# systemTheme
source: System
sw: Mfumo

source: Language
sw: Lugha

source: Choose Language
sw: Chagua Lugha

source: English
sw: Kiingereza

source: Swahili
sw: Kiswahili

source: General
sw: Jumla

source: Account
sw: Akaunti

source: Logout
sw: Ondoka

source: Notifications
sw: Taarifa

# helpHelp
source: Help
sw: Msaada

source: Privacy Policy
sw: Sera ya Faragha

# termsOfService
source: Terms & Conditions
sw: Vigezo na Masharti

source: Home
sw: Nyumbani

source: My Jobs
sw: Kazi Zangu

source: Profile
sw: Wasifu

source: Search
sw: Tafuta

# post_job_title
source: Post a Job
sw: Posti Kazi

# job_details_step
source: Job Details
sw: Maelezo ya Kazi

# location_payment_step
source: Location & Payment
sw: Mahali na Malipo

source: Fill job details
sw: Jaza maelezo ya kazi

# image_picker_camera
source: Take Photo
sw: Piga Picha

# image_picker_gallery
source: Choose from Gallery
sw: Chagua kutoka Gallery

# add_image_optional
source: Add Photo (Optional)
sw: Ongeza Picha (Optional)

source: Enter job title
sw: Ingiza kichwa cha kazi

# job_title_error
source: Please enter job title
sw: Tafadhali ingiza kichwa cha kazi

source: Select category
sw: Chagua kundi la kazi

# category_error
source: Please select a category
sw: Tafadhali chagua kundi

source: Your budget
sw: Bajeti yako

# budget_error
source: Please enter budget
sw: Tafadhali ingiza bajeti

# budget_invalid
source: Invalid budget
sw: Bajeti si sahihi

source: Phone Number
sw: Namba ya Simu

# phone_error
source: Enter phone number
sw: Ingiza namba ya simu

source: Additional details
sw: Maelezo ya ziada

# next_step_location
source: Location Step
sw: Hatua ya Mahali

# choose_location_title
source: Choose Location
sw: Chagua Mahali

# location_description
source: Where is the job located?
sw: Taja sehemu kazi inapofanyika

source: Use my location
sw: Tumia eneo langu

# posting_job
source: Posting your job...
sw: Tunaposti kazi yako...

# searching_workers
source: Searching for nearby workers...
sw: Tunatafuta maMfanyakazi karibu...

source: Go back
sw: Rudi nyuma

# search_post
source: Search and Post
sw: Tafuta na Posti

# job_posted_success
source: Job Posted!
sw: Kazi Imepostiwa!

# job_posted_message
source: Your job has been posted successfully. Workers will start applying soon.
sw: Kazi yako imepostiwa kwa mafanikio. MaMfanyakazi wataanza kuomba hivi punde.

# workers_found_title
source: Workers Found
sw: MaMfanyakazi Wamepatikana

# wait
source: Please wait
sw: Subiri kidogo

# post_job_btn
source: Post Job Now
sw: Posti Kazi Sasa

# no_workers_title
source: No Workers?
sw: Hakuna MaMfanyakazi?

# no_workers_message
source: We couldn't find workers nearby right now but we'll keep looking.
sw: Hatujapata maMfanyakazi karibu kwa sasa lakini tutaendelea kutafuta.

# network_error_title
source: Network Error
sw: Hitilafu ya Mtandao

# network_error_message
source: Failed to connect. Check your internet.
sw: Imeshindwa kuunganishwa. Angalia intaneti yako.

source: Cancel
sw: Ghairi

source: Post Anyway
sw: Posti Hivyohivyo

source: GPS permission denied
sw: Ruhusa ya GPS imekataliwa

source: Enable GPS
sw: Washa GPS

# how_to_find_worker
source: How to find a worker
sw: Jinsi ya kupata Mfanyakazi

# tips_description
source: Make sure to describe the job well and set a fair budget.
sw: Hakikisha unaelezea kazi vizuri na kuweka bajeti sahihi.

# categories_title
source: Job Categories
sw: Makundi ya Kazi

# recent_jobs_title
source: Recent Jobs
sw: Kazi za Hivi Karibuni

source: View All
sw: Ona Zote

source: View all categories
sw: Ona Kategoria Zote

# all_paid_msg
source: All jobs paid successfully!
sw: Kazi zote zimelipwa vizuri!

# amount_to_pay_label
source: Amount to pay:
sw: Kiasi cha kulipa:

source: Initiating payment...
sw: Inaanzisha malipo...

# confirm_payment_phone
source: Confirm payment on your phone
sw: Thibitisha malipo kwenye simu yako!

# refund_from_cancelled
source: This is a refund from cancelled jobs
sw: Pesa hii ni refund kutoka kazi zilizofutwa

# posted_jobs_label
source: Posted Jobs
sw: Kazi Zilizoposti

# balance_label
source: Your balance:
sw: Salio lako:

# mpesa_name_label
source: M-Pesa Name
sw: Jina la M-Pesa

# mpesa_name_hint
source: Name as registered on phone
sw: Jina lililosajiliwa kwenye simu

source: No jobs here
sw: Hakuna kazi hapa

source: Change Password
sw: Badili Password

# strengthen_security_subtitle
source: Strengthen account security
sw: Imarisha usalama wa akaunti

# notifications_subtitle
source: Get job and message notifications
sw: Pata arifa za kazi na meseji

# help_section_header
source: HELP & INFO
sw: MSAADA NA TAARIFA

source: Contact Us (WhatsApp)
sw: Wasiliana Nasi (WhatsApp)

# get_help_fast
source: Get help quickly
sw: Pata msaada haraka

source: Fees & Payments Policy
sw: Sera ya Malipo na Ada

source: Current Password
sw: Password ya Sasa

source: New Password
sw: Password Mpya

# password_changed_success
source: Password changed!
sw: Password imebadilishwa!

# language_updated_msg
source: Language updated.
sw: Lugha imesasishwa.

# failed_open_link
source: Failed to open link
sw: Imeshindikana kufungua link

# please_fill_here
source: Please fill this field
sw: Tafadhali jaza hapa

source: Update failed
sw: Imeshindikana kusasisha

# location_service_disabled
source: Location service is disabled
sw: Huduma ya eneo haijawashwa

source: Location permission denied
sw: Ruhusa ya eneo imekataliwa

# location_permission_denied_forever
source: Location permission permanently denied
sw: Ruhusa ya eneo imekataliwa kabisa

# jobs_will_appear_here
source: Posted jobs will appear here.
sw: Kazi zitakazopostiwa zitaonekana hapa.

# all_tab
source: All
sw: Zote

# active_tab
source: Active
sw: Zinazoendelea

# completed_tab
source: Completed
sw: Zilizokamilika

source: Retry Payment
sw: Jaribu Malipo Tena

source: Delete Job
sw: Futa Kazi

# confirm_delete_job
source: Are you sure you want to delete this job?
sw: Je, una uhakika unataka kufuta kazi hii?

source: Yes, Delete
sw: Ndiyo, Futa

source: No
sw: Hapana

# job_deleted_success
source: Job deleted successfully.
sw: Kazi imefutwa kwa mafanikio.

source: Payment initiated.
sw: Malipo yameanzishwa.

source: Conversations
sw: Mazungumzo

source: No conversations
sw: Hakuna mazungumzo

# conversations_subtitle
source: Start talking to workers here.
sw: Anza kuongea na maMfanyakazi hapa.

source: Edit Profile
sw: Badili Wasifu

source: Save Changes
sw: Hifadhi

source: Full Name
sw: Majina Kamili

# enter_name
source: Enter your name
sw: Ingiza majina yako

# profile_updated_success
source: Profile updated.
sw: Profile imesasishwa.

# user_info_missing
source: Information missing.
sw: Taarifa hazitoshi.

# status_completed
source: Completed
sw: Imekamilika

# status_assigned
source: Assigned
sw: Imepewa Mfanyakazi

# status_in_progress
source: In Progress
sw: Inafanyika

# status_active
source: Live
sw: Ipo Hewani

# status_offered
source: Waiting for Worker
sw: Inasubiri Mfanyakazi

# status_cancelled
source: Cancelled
sw: Imefutwa

# status_pending_payment
source: Pending Payment
sw: Inasubiri Malipo

# status_empty
source: No Status
sw: Haina Hali

# location_title
source: Work Location
sw: Eneo la Kazi

source: Worker Applications
sw: Maombi ya MaMfanyakazi

source: No applications yet
sw: Hakuna maombi bado

# wait_for_workers
source: Wait for workers to see your job.
sw: Subiri maMfanyakazi waone kazi yako.

# assigned_worker
source: Selected Worker
sw: Mfanyakazi Aliyechaguliwa

# completion_code_title
source: Completion Code
sw: Code ya Kumaliza Kazi

# give_code_instruction
source: Give this code to the worker when finished.
sw: Mpe Mfanyakazi code hii akimaliza kazi.

# delete_job_btn
source: Delete Job
sw: Futa Kazi

source: Deleting...
sw: Inafuta...

# call_worker
source: Call
sw: Piga Simu

# chat_with_worker
source: Chat
sw: Chat na Mfanyakazi

source: Select Worker
sw: Chagua Mfanyakazi

source: Offer Price
sw: Ofa ya Bei

source: Reviews
sw: Uhiki

source: Find Jobs
sw: Tafuta Kazi

source: Wallet Balance
sw: Salio la Wallet

source: Total Earnings
sw: Jumla ya Mapato

# jobs_done
source: Jobs Completed
sw: Kazi Zilizofanywa

# withdraw_btn
source: Withdraw
sw: Toa Pesa

# active_jobs_title
source: Active Jobs
sw: Kazi Zinazoendelea

source: No active jobs
sw: Huna kazi inayoendelea

# no_active_jobs_sub
source: Find a job to start earning.
sw: Tafuta kazi uanze kupata kipato.

# press_to_complete
source: Press if finished
sw: Bonyeza kama umemaliza

source: Complete existing job
sw: Maliza kazi iliyopo

# complete_existing_job_sub
source: You cannot take another job until you finish this one.
sw: Huwezi kuchukua kazi nyingine mpaka umalize hii.

source: Return to Job
sw: Rudi kwenye Kazi

# search_jobs_hint
source: Search jobs here...
sw: Tafuta kazi hapa...

source: No jobs found
sw: Hakuna kazi iliyopatikana

# no_jobs_found_sub
source: Try searching with another name.
sw: Jaribu kutafuta kwa jina lingine.

# new_tag
source: NEW
sw: MPYA

# apply_btn
source: Apply for Job
sw: Omba Kazi

# worker_role
source: Worker
sw: Mfanyakazi

# my_profile_menu
source: My Profile
sw: Wasifu Wangu

# settings_menu
source: Settings
sw: Mipangilio

# logout_menu
source: Logout
sw: Toka

# job_description_title
source: Job Description
sw: Maelezo ya Kazi

# client_budget
source: Client's Budget
sw: Bajeti ya Mteja

# client_label
source: Client
sw: Mteja

# new_client_tag
source: New Client
sw: Mteja Mpya

# bids_title
source: Your Bids
sw: Maombi yako

# accept_btn
source: Accept
sw: Kubali

# decline_btn
source: Decline
sw: Kataa

# complete_job_code_btn
source: Enter Completion Code
sw: Weka Code ya Kumaliza

# ask_question_btn
source: Ask Question
sw: Uliza Swali

# send_offer_btn
source: Send Offer
sw: Tuma Ofa

# ask_question_title
source: Ask Question
sw: Uliza Swali

# enter_message_hint
source: Write your message...
sw: Andika ujumbe wako...

# cancel_btn
source: Cancel
sw: Futa

# send_message_btn
source: Send Message
sw: Tuma Ujumbe

# send_offer_title
source: Send Price Offer
sw: Tuma Ofa ya Bei

# your_price_label
source: Your Price (TSh)
sw: Bei yako (TSh)

# message_to_client_label
source: Message to client
sw: Ujumbe kwa mteja

# why_choose_you_hint
source: Why should the client choose you?
sw: Kwa nini mteja akuchague?

# submit_application_btn
source: Submit Application
sw: Tuma Ombi

# success_application_sent
source: Your application has been sent!
sw: Ombi lako limetumwa!

# job_accepted_success
source: You have accepted this job.
sw: Umeikubali kazi hii.

# enter_completion_code
source: Enter Code
sw: Ingiza Code

# verify_btn
source: Verify
sw: Thibitisha

# job_completed_success
source: Congratulations! Job completed.
sw: Hongera! Kazi imekamilika.

# completion_failed
source: Invalid code. Try again.
sw: Code si sahihi. Jaribu tena.

source: Hello
sw: Habari

# now
source: Just now
sw: Sasa hivi

# time_minutes
source: minutes
sw: Dakika

# time_hours
source: hours
sw: Saa

# time_days
source: days
sw: Siku

# time_weeks
source: weeks
sw: wiki

# time_ago_suffix
source: ago
sw: zilizopita

# time_month
source: month
sw: mwezi

# time_months
source: months
sw: miezi

source: Distance (Radius)
sw: Umbali (Radius)

source: Loading...
sw: Inapakia...

source: Job Details
sw: Maelezo ya Kazi

source: Congratulations!
sw: Hongera sana!

# job_completed_content
source: Job completed and payment received.
sw: Kazi imekamilika na malipo yameingia.

source: You earned
sw: Umeingiza

# ok_btn
source: OK
sw: Sawa

# active_job_title
source: Current Job
sw: Kazi ya Sasa

# completion_request_hint
source: Ask client for code to finish job
sw: Omba code kwa mteja umalize kazi

# service_label
source: Service
sw: Huduma

# enter_completion_code_title
source: Enter Completion Code
sw: Ingiza Code ya Kumaliza

# chat_with_client_btn
source: Chat with Client
sw: Chat na Mteja

# complete_job_button
source: Finish Job
sw: Maliza Kazi

# success_message_sent
source: Message sent!
sw: Ujumbe umetumwa!

# job_accept_failed
source: Failed to accept job.
sw: Imeshindwa kukubali kazi.

# complete_job_title
source: Complete Job
sw: Kamilisha Kazi

source: Searching messages...
sw: Tunasaka ujumbe...

source: No messages found
sw: Hakuna ujumbe hapa

# no_messages_found_sub
source: Your messages will appear here.
sw: Ujumbe wako utaonekana hapa.

# failed_send_message
source: Message failed to send.
sw: Ujumbe haujatuma.

# no_messages_yet_start
source: Start the conversation now.
sw: Anza maongezi sasa hivi.

# jobs_label
source: Jobs
sw: Kazi

# completion_label
source: Completion
sw: Kukamilika

# filter_active
source: Active
sw: Zinazoendelea

# filter_nearby
source: Nearby
sw: Zilizokaribu

# filter_high_pay
source: High Pay
sw: Bei Nzuri

# terms_accept_label
source: I agree to the
sw: Nakubaliana na

# terms_link_text
source: TERMS AND CONDITIONS
sw: VIGEZO NA MASHARTI

# terms_error
source: You must accept terms and conditions
sw: Lazima ukubali vigezo na masharti

# welcome_title_1
source: Welcome to TendaPoa
sw: Karibu TendaPoa

# welcome_subtitle_1
source: The platform to easily connect workers and clients. Get a worker, get a job.
sw: Jukwaa la kuunganisha wafanyakazi na wateja kwa urahisi. Pata mfanyakazi, pata kazi.

# welcome_title_2
source: Find a Worker
sw: Tafuta Mfanyakazi

# welcome_subtitle_2
source: Find a great worker near you in just a few minutes. View their work and reviews.
sw: Pata mfanyakazi mzuri karibu nawe kwa dakika chache tu. Angalia kazi zake na uhakiki.

# welcome_title_3
source: Get a Job
sw: Pata Kazi

# welcome_subtitle_3
source: If you are a worker, register and start getting various jobs to increase your income.
sw: Kama wewe ni mfanyakazi, jisajili na uanze kupata kazi mbalimbali na kuongeza kipato.

# welcome_title_4
source: Secure Payments
sw: Malipo Salama

# welcome_subtitle_4
source: Pay with complete security. Your money is held until the job is fully completed.
sw: Lipa kwa usalama kabisa. Pesa yako inatunzwa mpaka kazi ikamilike kikamilifu.

source: Skip
sw: Ruka

source: Start Now
sw: Anza Sasa

# continue_btn
source: Continue
sw: Endelea

# have_account_login
source: Already have an account? Login
sw: Tayari nina akaunti? Ingia

# welcome_have_account
source: Already have an account?
sw: Tayari una akaunti?

# welcome_login_link
source: Login here
sw: Ingia hapa

# login_welcome_title
source: Welcome Back!
sw: Karibu Tena!

# login_subtitle
source: Sign in to your account to continue.
sw: Ingia kwenye akaunti yako ili uendelee.

# login_email_label
source: Email
sw: Barua Pepe

# login_email_hint
source: e.g. email@example.com
sw: mfano@email.com

# login_password_label
source: Password
sw: Nenosiri

# login_forgot_password
source: Forgot Password?
sw: Umesahau Nenosiri?

# login_terms_agree
source: I agree to
sw: Nimekubali

# login_terms_link
source: Terms and Conditions
sw: Vigezo na Masharti

# login_btn
source: Sign In
sw: Ingia Sasa

# login_no_account
source: Don't have an account?
sw: Huna akaunti?

# login_register_here
source: Register here
sw: Jiunge hapa

# login_accept_terms_error
source: Please accept the terms and conditions
sw: Tafadhali kubali vigezo na masharti

# login_failed_error
source: Login failed
sw: Imeshindwa kuingia

# login_enter_email
source: Enter email
sw: Weka barua pepe

# login_enter_password
source: Enter password
sw: Weka nenosiri

# nyumbani_nav
source: Home
sw: Nyumbani

# kazi_zangu_nav
source: My Jobs
sw: Kazi Zangu

# wasifu_nav
source: Profile
sw: Wasifu

# ask_worker_query
source: What worker are you looking for today?
sw: Unatafuta Mfanyakazi gani leo?

# search_hint
source: Search worker, service...
sw: Tafuta Mfanyakazi, huduma...

# services_label
source: Services
sw: Huduma

# nearby_workers_label
source: Nearby Workers
sw: MaMfanyakazi Karibu

# no_workers_nearby
source: No workers nearby at the moment.
sw: Hakuna maMfanyakazi karibu kwa sasa.

source: Failed to delete
sw: Imeshindwa kufuta

# payment_retried
source: Payment process restarted.
sw: Mchakato wa malipo umeanza tena.

# no_jobs_posted_yet
source: You haven't posted any jobs yet
sw: Hujaposti kazi bado

# working_status
source: Work Well, Get Paid Well!
sw: Tenda Poa, Lipwa Poa!

# active_job_label
source: Active Job
sw: Kazi Inayoendelea

# total_completed_jobs
source: Completed Jobs
sw: Kazi Zilizokamilika

source: Your Rating
sw: Rating Yako

# withdraw_money_btn
source: Withdraw Cash
sw: Toa Pesa

# no_active_job_msg
source: You have no active job now
sw: Huna kazi inayoendelea sasa

# complete_current_job_first
source: Complete Current Job
sw: Kamilisha Kazi Iliyopo

# cannot_see_new_jobs_msg
source: You cannot see new jobs while you have an active job. Please complete the current job first.
sw: Huwezi kuona kazi mpya wakati una kazi inayoendelea. Tafadhali kamilisha kazi ya sasa kwanza.

# view_your_job_btn
source: VIEW YOUR JOB
sw: ANGALIA KAZI YAKO

# job_market_label
source: Job Market
sw: Soko la Kazi

# selected_jobs_title
source: Jobs You Were Selected For
sw: Kazi Zilizokuchagua

# selected_jobs_subtitle
source: Clients have selected you - accept or decline
sw: Wateja wamekuchagua - kubali au kataa

# assigned_jobs_appear_here
source: Jobs assigned to you will appear here
sw: Kazi ulizopewa zitaonekana hapa

# no_jobs_available
source: No Jobs Now
sw: Hakuna Kazi Sasa

# try_again_later_msg
source: Try again later or change location
sw: Jaribu tena baadaye au badilisha eneo

# edit_profile_menu
source: Edit Profile
sw: Badili Wasifu

# job_history_menu
source: Job History
sw: Historia ya Kazi

# help_menu
source: Help
sw: Msaada

# worker_selected_success
source: Worker selected successfully!
sw: Mfanyakazi amechaguliwa!

# failed_fetch_job_details
source: Failed to fetch job details
sw: Imeshindwa kupata taarifa za kazi

# apply_job_dialog_title
source: Apply for this Job
sw: Omba Kazi Hii

# bid_hint
source: Enter your price and a short message...
sw: Andika bei yako na maelezo mafupi...

# posted_by_label
source: Posted this job
sw: Ameposti kazi hii

# completion_code_label
source: Completion Code
sw: Kodi ya Kukamilisha

# no_desc
source: No description
sw: Hakuna maelezo

# no_location
source: Location not specified
sw: Mahali haijatajwa

source: Tap to expand
sw: Bonyeza kukubwa

source: Verified Client
sw: Mteja Aliyethibitishwa

source: Your Application
sw: Ombi Lako

# you_applied
source: You applied for this job
sw: Umeomba kazi hii

source: Other Applications
sw: Maombi Mengine

# be_first_to_apply
source: Be the first to apply for this job!
sw: Kuwa wa kwanza kuomba kazi hii!

# your_proposed_price
source: Your offer
sw: Bei uliyopendekeza

# current_price_min_prefix
source: Current: TZS
sw: Bei ya sasa: TZS

# price_label_short
source: Price: TZS
sw: Bei: TZS

# wallet_title
source: My Wallet
sw: Mkoba Wangu

# deposit_btn
source: Deposit
sw: Weka Pesa

source: Recent Transactions
sw: Miamala ya Hivi Karibuni

source: No transactions
sw: Hakuna miamala

source: Transaction
sw: Muamala

# verifying_code
source: Verifying...
sw: Inathibitisha...

# enter_code_error
source: Please enter the completion code
sw: Tafadhali weka kodi ya kukamilisha

# status_label
source: JOB STATUS
sw: HALI YA KAZI

source: Who are you?
sw: Wewe ni nani?

# role_select_title
source: Choose Account Type
sw: Chagua Aina ya Akaunti

# role_select_subtitle
source: Tell us how you'd like to use Tendapoa so we can help you better.
sw: Niambie namna ungependa kutumia Tendapoa ili tusaidie vizuri.

# role_muhitaji_title
source: Client
sw: Muhitaji

# role_muhitaji_desc
source: I am looking for a worker/handyman
sw: Ninatafuta mfanyakazi/Mfanyakazi

# role_mfanyakazi_title
source: Worker
sw: Mfanyakazi

# role_mfanyakazi_desc
source: I am a worker looking for jobs
sw: Mimi ni Mfanyakazi, ninatafuta kazi

# withdraw_request_title
source: Request Withdrawal
sw: Omba Kutoa Pesa

# withdrawal_amount_label
source: Withdrawal Amount
sw: Kiasi unachotoa

# amount_hint
source: Example: 10000
sw: Mfano: 10000

# min_withdrawal_error
source: Minimum withdrawal is 2000
sw: Kiwango cha chini ni 2000

# insufficient_balance_error
source: Insufficient balance
sw: Salio halitoshi

# phone_networks_label
source: Phone Number (M-PESA/Tigo Pesa)
sw: Namba ya Simu (M-PESA/Tigo Pesa)

# submit_request_btn
source: Submit Request
sw: Tuma Maombi

# withdrawal_success_msg
source: Your request has been sent for verification.
sw: Maombi yako yametumwa kwa ajili ya uhakiki.

# withdrawal_request_title
source: Withdrawal Request
sw: Ombi la Uchukuliaji

# amount_to_withdraw_label
source: Amount you want to withdraw
sw: Kiasi unachotaka kutoa

# enter_amount_required
source: Enter amount
sw: Weka kiasi

# invalid_number_error
source: Invalid number
sw: Namba si sahihi

# min_2000_error
source: Minimum is 2,000
sw: Kiwango cha chini ni 2,000

# payment_phone_label
source: Payment phone number
sw: Namba ya Simu ya Malipo

# enter_phone_required
source: Enter phone number
sw: Weka namba

# error_occurred
source: An error occurred
sw: Hitilafu ilitokea

# try_again_btn
source: Try Again
sw: Jaribu Tena

# status_open
source: Open
sw: Ipo Wazi

# status_pending_applications
source: Pending Applications
sw: Inasubiri Maombi

# status_accepted
source: In Progress
sw: Inafanyiwa Kazi

# retry_payment_btn
source: Retry Payment
sw: Lipia Tena

# register_password_mismatch
source: Passwords do not match!
sw: Nenosiri halifanani!

# register_failed
source: Registration failed
sw: Imeshindwa kusajili

# register_location_required_title
source: Location Required!
sw: Eneo Linahitajika!

# register_location_required_subtitle
source: As a worker, your location is required so that:
sw: Kama mfanyakazi, eneo lako ni lazima ili:

# register_location_reason_1
source: Clients can see your distance
sw: Wateja waone umbali wako

# register_location_reason_2
source: You get jobs near you
sw: Upate kazi zilizo karibu nawe

# register_location_reason_3
source: The system calculates distance correctly
sw: Mfumo uhesabu umbali kwa usahihi

# register_location_ok_btn
source: OK, I'LL SET LOCATION
sw: SAWA, NITAWEKA ENEO

# register_badge_muhitaji
source: Client
sw: Muhitaji / Mteja

# register_badge_mfanyakazi
source: Worker / Handyman
sw: Mfanyakazi / Mfanyakazi

# register_title_muhitaji
source: Welcome to TendaPoa!
sw: Karibu TendaPoa!

# register_title_mfanyakazi
source: Join TendaPoa!
sw: Jiunge na TendaPoa!

# register_subtitle_muhitaji
source: Find great workers near you
sw: Pata wafanyakazi wazuri karibu nawe

# register_subtitle_mfanyakazi
source: Start getting jobs near you today
sw: Anza kupata kazi karibu nawe leo

# register_section_personal
source: Personal Info
sw: Taarifa Binafsi

# register_full_name
source: Full Name
sw: Jina Kamili

# register_full_name_hint
source: e.g. John Doe
sw: Mfano: Juma Ramadhani

# register_full_name_error
source: Please enter your name
sw: Tafadhali weka jina lako

# register_email_error
source: Please enter email
sw: Tafadhali weka email

# register_email_invalid
source: Invalid email
sw: Email si sahihi

# register_phone_error
source: Please enter phone number
sw: Tafadhali weka namba ya simu

# register_phone_invalid
source: Invalid phone number
sw: Namba ya simu si sahihi

# register_section_security
source: Security
sw: Usalama

# register_confirm_password
source: Confirm Password
sw: Thibitisha Nenosiri

# register_confirm_password_error
source: Please confirm password
sw: Tafadhali thibitisha nenosiri

# register_password_min
source: Password must be at least 6 characters
sw: Nenosiri liwe na herufi 6 au zaidi
